dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	/* Set Power State to ON */
	HAL_Delay(10);

	if (SDMMC_PowerState_ON(hsd->Instance) != HAL_OK)
	{
		return HAL_ERROR;
	}

	/* Required power up waiting time before starting the SD initialization sequence */
	HAL_Delay(2U);

	return HAL_OK;
}


/**
  * @brief  De-Initializes the SD card.
  * @param  hsd: Pointer to SD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_DeInit(SD_HandleTypeDef *hsd)
{
	/* Check the SD handle allocation */
	if (hsd == NULL)
	{
		return HAL_ERROR;
	}

	/* Check the parameters */
	assert_param(IS_SDMMC_ALL_INSTANCE(hsd->Instance));

	hsd->State = HAL_SD_STATE_BUSY;

	/* Set SD power state to off */
	SD_PowerOFF(hsd);

	hsd->ErrorCode = HAL_SD_ERROR_NONE;
	hsd->State = HAL_SD_STATE_RESET;

	return HAL_OK;
}


/**
  * @brief  Initializes the SD Card.
  * @param  hsd: Pointer to SD handle
  * @note   This function initializes the SD card. It could be used when a card
            re-initialization is needed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_InitCard(SD_HandleTypeDef *hsd)
{
	uint32_t errorstate;

	HAL_StatusTypeDef status;
	SD_InitTypeDef Init;


	/* Default SDMMC peripheral configuration for SD card initialization */
	Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
#endif	/* !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx && !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
	Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
	Init.BusWide = SDMMC_BUS_WIDE_1B;
	Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
	Init.ClockDiv = SDMMC_INIT_CLK_DIV;

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	if (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE)
	{
		/* Set Transceiver polarity */
		hsd->Instance->POWER |= SDMMC_POWER_DIRPOL;
	}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	/* Initialize SDMMC peripheral interface with default configuration */
	HAL_Delay(10);
	status = SDMMC_Init(hsd->Instance, Init);
	if (status != HAL_OK)
	{
		return HAL_ERROR;
	}

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	/* Disable SDMMC Clock */
	__HAL_SD_DISABLE(hsd);
#endif	/* !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx && !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

	/* Set Power State to ON */
	HAL_Delay(10);
	status = SDMMC_PowerState_ON(hsd->Instance);
	if (status != HAL_OK)
	{
		return HAL_ERROR;
	}

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	/* Enable SDMMC Clock */
	__HAL_SD_ENABLE(hsd);

#endif	/* !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx && !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

	/* Required power up waiting time before starting the SD initialization sequence */
	HAL_Delay(2U);

	/* Identify card operating voltage */
	HAL_Delay(10);

	errorstate = SD_PowerON(hsd);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		hsd->State = HAL_SD_STATE_READY;
		hsd->ErrorCode |= errorstate;

		return HAL_ERROR;
	}

	/* Card initialization */
	HAL_Delay(10);

	errorstate = SD_InitCard(hsd);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		hsd->State = HAL_SD_STATE_READY;
		hsd->ErrorCode |= errorstate;

		return HAL_ERROR;
	}

	HAL_Delay(10);

	return HAL_OK;
}


/**
  * @brief  Initializes the SD card device.
  * @retval SD status
  */
uint8_t BSP_SD_Init(void)
{
	uint8_t sd_state = MSD_OK;

	/* uSD device interface configuration */
	hsd_eval.Instance = SDMMC1;
	hsd_eval.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
	hsd_eval.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
	hsd_eval.Init.BusWide = SDMMC_BUS_WIDE_4B;
	hsd_eval.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_ENABLE;
	hsd_eval.Init.ClockDiv = 1;
	hsd_eval.Init.Transceiver = SDMMC_TRANSCEIVER_DISABLE;

	/* HAL SD initialization */
	if (HAL_SD_Init(&hsd_eval) != HAL_OK)
	{
		sd_state = MSD_ERROR;
		printf("BSP_SD_Init ERROR!!\r\n");
	}

	return sd_state;
}

uint8_t BSP_SD_InitCard(void)
{
	/* Initialize the Card parameters */
	HAL_Delay(10);

	if (HAL_SD_InitCard(&hsd_eval) != HAL_OK)
	{
		return HAL_ERROR;
	}

	return HAL_OK;
}


uint8_t BSP_SD_InitEnd(void)
{
	SD_HandleTypeDef *hsd = &hsd_eval;

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	/* Configure the bus wide */
	if (HAL_SD_ConfigWideBusOperation(hsd, hsd->Init.BusWide) != HAL_OK)
	{
		HAL_Delay(10);
		return HAL_ERROR;
	}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	/* Initialize the error code */
	hsd->ErrorCode = HAL_SD_ERROR_NONE;

	/* Initialize the SD operation */
	hsd->Context = SD_CONTEXT_NONE;

	/* Initialize the SD state */
	hsd->State = HAL_SD_STATE_READY;

	return HAL_OK;
}


/**
  * @brief  DeInitializes the SD card device.
  * @retval SD status
  */
uint8_t BSP_SD_DeInit(void)
{
	uint8_t sd_state = MSD_OK;

	hsd_eval.Instance = SDMMC1;

	/* HAL SD deinitialization */
	if (HAL_SD_DeInit(&hsd_eval) != HAL_OK)
	{
		sd_state = MSD_ERROR;
	}

	/* Msp SD deinitialization */
	BSP_SD_MspDeInit(&hsd_eval, NULL);

	return sd_state;
}


/**
  * @brief  Reads block(s) from a specified address in an SD card, in DMA mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read
  * @param  NumOfBlocks: Number of SD blocks to read
  * @retval SD status
  */
uint8_t BSP_SD_ReadBlocks_DMA(uint32_t *pData, uint32_t DataSize, uint32_t BlockSize)
{
	HAL_StatusTypeDef sd_state = HAL_OK;

