dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	/* Read block(s) in DMA transfer mode */
	sd_state = HAL_SD_ReadBlocks_DMA(&hsd_eval, (uint8_t *) pData, DataSize, BlockSize);

	return sd_state;
}



/** @defgroup HAL_SDMMC_LL_Group2 IO operation functions
 *  @brief   Data transfers functions
 *
@verbatim
 ===============================================================================
                      ##### I/O operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the SDMMC data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Read data (word) from Rx FIFO in blocking mode (polling)
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_ReadFIFO(SDMMC_TypeDef *SDMMCx)
{
	/* Read data from Rx FIFO */
	return (SDMMCx->FIFO);
}


/**
  * @brief  Write data (word) to Tx FIFO in blocking mode (polling)
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  pWriteData: pointer to data to write
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_WriteFIFO(SDMMC_TypeDef *SDMMCx, uint32_t *pWriteData)
{
	/* Write data to FIFO */
	SDMMCx->FIFO = *pWriteData;

	return HAL_OK;
}


/**
  * @}
  */

/** @defgroup HAL_SDMMC_LL_Group3 Peripheral Control functions
 *  @brief   management functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the SDMMC data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Set SDMMC Power state to ON.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_PowerState_ON(SDMMC_TypeDef *SDMMCx)
{
	/* Set power state to ON */
#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	SDMMCx->POWER |= SDMMC_POWER_PWRCTRL;
#else	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	SDMMCx->POWER = SDMMC_POWER_PWRCTRL;
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	return HAL_OK;
}


#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
/**
  * @brief  Set SDMMC Power state to Power-Cycle.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_PowerState_Cycle(SDMMC_TypeDef *SDMMCx)
{
	/* Set power state to Power Cycle */
	SDMMCx->POWER |= SDMMC_POWER_PWRCTRL_1;

	return HAL_OK;
}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

/**
  * @brief  Set SDMMC Power state to OFF.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_PowerState_OFF(SDMMC_TypeDef *SDMMCx)
{
	/* Set power state to OFF */
#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	SDMMCx->POWER &= ~(SDMMC_POWER_PWRCTRL);
#else	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	SDMMCx->POWER = (uint32_t) 0x00000000;
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	return HAL_OK;
}


/**
  * @brief  Get SDMMC Power state.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval Power status of the controller. The returned value can be one of the
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x02: Power UP
  *            - 0x03: Power ON
  */
uint32_t SDMMC_GetPowerState(SDMMC_TypeDef *SDMMCx)
{

	return (SDMMCx->POWER & SDMMC_POWER_PWRCTRL);
}




/** @defgroup HAL_SDMMC_LL_Group4 Command management functions
 *  @brief   Data transfers functions
 *
@verbatim
 ===============================================================================
                   ##### Commands management functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the needed commands.

@endverbatim
  * @{
  */

/**
  * @brief  Send the Data Block Lenght command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdBlockLength(SDMMC_TypeDef *SDMMCx, uint32_t BlockSize)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) BlockSize;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SET_BLOCKLEN;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SET_BLOCKLEN, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Read Single Block command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdReadSingleBlock(SDMMC_TypeDef *SDMMCx, uint32_t ReadAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) ReadAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_READ_SINGLE_BLOCK;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_READ_SINGLE_BLOCK, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Read Multi Block command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdReadMultiBlock(SDMMC_TypeDef *SDMMCx, uint32_t ReadAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) ReadAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_READ_MULT_BLOCK;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_READ_MULT_BLOCK, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Write Single Block command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdWriteSingleBlock(SDMMC_TypeDef *SDMMCx, uint32_t WriteAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) WriteAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_WRITE_SINGLE_BLOCK;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_WRITE_SINGLE_BLOCK, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Write Multi Block command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdWriteMultiBlock(SDMMC_TypeDef *SDMMCx, uint32_t WriteAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) WriteAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_WRITE_MULT_BLOCK;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_WRITE_MULT_BLOCK, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Start Address Erase command for SD and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdSDEraseStartAdd(SDMMC_TypeDef *SDMMCx, uint32_t StartAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) StartAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SD_ERASE_GRP_START;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SD_ERASE_GRP_START, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the End Address Erase command for SD and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdSDEraseEndAdd(SDMMC_TypeDef *SDMMCx, uint32_t EndAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) EndAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SD_ERASE_GRP_END;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SD_ERASE_GRP_END, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Start Address Erase command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdEraseStartAdd(SDMMC_TypeDef *SDMMCx, uint32_t StartAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) StartAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_ERASE_GRP_START;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_ERASE_GRP_START, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the End Address Erase command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdEraseEndAdd(SDMMC_TypeDef *SDMMCx, uint32_t EndAdd)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = (uint32_t) EndAdd;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_ERASE_GRP_END;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_ERASE_GRP_END, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Erase command and check the response
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdErase(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Set Block Size for Card */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_ERASE;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_ERASE, SDMMC_MAXERASETIMEOUT);

	return errorstate;
}


/**
  * @brief  Configure the SDMMC command path according to the specified parameters in
  *         SDMMC_CmdInitTypeDef structure and send the command
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Command: pointer to a SDMMC_CmdInitTypeDef structure that contains
  *         the configuration information for the SDMMC command
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_SendCommand(SDMMC_TypeDef *SDMMCx, SDMMC_CmdInitTypeDef *Command)
{
	/* Check the parameters */
	assert_param(IS_SDMMC_CMD_INDEX(Command->CmdIndex));
	assert_param(IS_SDMMC_RESPONSE(Command->Response));
	assert_param(IS_SDMMC_WAIT(Command->WaitForInterrupt));
	assert_param(IS_SDMMC_CPSM(Command->CPSM));

	/* Set the SDMMC Argument value */
	SDMMCx->ARG = Command->Argument;

	/* Set SDMMC command parameters */
	/* Write to SDMMC CMD register */
	MODIFY_REG(SDMMCx->CMD, CMD_CLEAR_MASK, Command->CmdIndex | \
			   Command->Response | \
			   Command->WaitForInterrupt | \
			   Command->CPSM);

	return HAL_OK;
}


/**
  * @brief  Return the command index of last command for which response received
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval Command index of the last command response received
  */
uint8_t SDMMC_GetCommandResponse(SDMMC_TypeDef *SDMMCx)
{

	return (uint8_t)(SDMMCx->RESPCMD);
}



/**
  * @brief  Return the response received from the card for the last command
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Response: Specifies the SDMMC response register.
  *          This parameter can be one of the following values:
  *            @arg SDMMC_RESP1: Response Register 1
  *            @arg SDMMC_RESP2: Response Register 2
  *            @arg SDMMC_RESP3: Response Register 3
  *            @arg SDMMC_RESP4: Response Register 4
  * @retval The Corresponding response register value
  */
uint32_t SDMMC_GetResponse(SDMMC_TypeDef *SDMMCx, uint32_t Response)
{
	uint32_t tmp;

	/* Check the parameters */
	assert_param(IS_SDMMC_RESP(Response));

