dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	/* Get the response */
	tmp = (uint32_t)(&(SDMMCx->RESP1)) + Response;

	return (*(__IO uint32_t *) tmp);
}


/** @addtogroup SD_Private_Functions
  * @{
  */
uint32_t hal_sd_cmd_52(uint32_t argument, uint32_t *response)
{
	uint32_t errorstate;

	errorstate = SDMMC_Cmd52(hsd_eval.Instance, argument, response);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	return HAL_OK;
}


uint32_t hal_sd_cmd_53(uint32_t argument, uint32_t *response)
{
	uint32_t errorstate;

	errorstate = SDMMC_Cmd53(hsd_eval.Instance, argument, response);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	return HAL_OK;
}



/**
  * @brief  Send the Stop Transfer command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdStopTransfer(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD12 STOP_TRANSMISSION  */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_STOP_TRANSMISSION;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_STOP_TRANSMISSION, SDMMC_STOPTRANSFERTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Select Deselect command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  addr: Address of the card to be selected
  * @retval HAL status
  */
uint32_t SDMMC_CmdSelDesel(SDMMC_TypeDef *SDMMCx, uint64_t Addr)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;
	uint32_t response;

	/* Send CMD7 SDMMC_SEL_DESEL_CARD */
	sdmmc_cmdinit.Argument = (uint32_t) Addr;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SEL_DESEL_CARD;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1_internal(SDMMCx, SDMMC_CMD_SEL_DESEL_CARD, SDMMC_CMDTIMEOUT, &response);

	return errorstate;
}


/**
  * @brief  Send the Go Idle State command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdGoIdleState(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_GO_IDLE_STATE;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_NO;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdError(SDMMCx);

	return errorstate;
}


/**
  * @brief  Send the Operating Condition command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_Cmd5(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD5 */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SDMMC_SEN_OP_COND;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_NO;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdError(SDMMCx);

	return errorstate;
}


static uint32_t SDMMC_Cmd52(SDMMC_TypeDef *SDMMCx, uint32_t arg, uint32_t *response)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = arg;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SDMMC_RW_DIRECT;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1_internal(SDMMCx, SDMMC_CMD_SDMMC_RW_DIRECT, SDMMC_CMDTIMEOUT, response);

	return errorstate;
}


static uint32_t SDMMC_Cmd53(SDMMC_TypeDef *SDMMCx, uint32_t arg, uint32_t *response)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD53 */
	sdmmc_cmdinit.Argument = arg;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SDMMC_RW_EXTENDED;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SDMMC_RW_DIRECT, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Operating Condition command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdOperCond(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD8 to verify SD card interface operating condition */
	/* Argument: - [31:12]: Reserved (shall be set to '0')
	   - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
	   - [7:0]: Check Pattern (recommended 0xAA) */
	/* CMD Response: R7 */
	sdmmc_cmdinit.Argument = SDMMC_CHECK_PATTERN;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_HS_SEND_EXT_CSD;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp7(SDMMCx);

	return errorstate;
}


/**
  * @brief  Send the Application command to verify that that the next command
  *         is an application specific com-mand rather than a standard command
  *         and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Argument: Command Argument
  * @retval HAL status
  */
uint32_t SDMMC_CmdAppCommand(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = (uint32_t) Argument;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_APP_CMD;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	/* If there is a HAL_ERROR, it is a MMC card, else
	   it is a SD card: SD card 2.0 (voltage range mismatch)
	   or SD card 1.x */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_APP_CMD, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the command asking the accessed card to send its operating
  *         condition register (OCR)
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Argument: Command Argument
  * @retval HAL status
  */
uint32_t SDMMC_CmdAppOperCommand(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	sdmmc_cmdinit.Argument = Argument;
#else	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	sdmmc_cmdinit.Argument = SDMMC_VOLTAGE_WINDOW_SD | Argument;
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SD_APP_OP_COND;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp3(SDMMCx);

	return errorstate;
}


/**
  * @brief  Send the Bus Width command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  BusWidth: BusWidth
  * @retval HAL status
  */
uint32_t SDMMC_CmdBusWidth(SDMMC_TypeDef *SDMMCx, uint32_t BusWidth)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

