dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	sdmmc_cmdinit.Argument = (uint32_t) BusWidth;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_APP_SD_SET_BUSWIDTH;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_APP_SD_SET_BUSWIDTH, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Send SCR command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdSendSCR(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD51 SD_APP_SEND_SCR */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SD_APP_SEND_SCR;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SD_APP_SEND_SCR, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Send CID command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdSendCID(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD2 ALL_SEND_CID */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_ALL_SEND_CID;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_LONG;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp2(SDMMCx);

	return errorstate;
}


/**
  * @brief  Send the Send CSD command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Argument: Command Argument
  * @retval HAL status
  */
uint32_t SDMMC_CmdSendCSD(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD9 SEND_CSD */
	sdmmc_cmdinit.Argument = Argument;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SEND_CSD;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_LONG;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp2(SDMMCx);

	return errorstate;
}


/**
  * @brief  Send the Send CSD command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  pRCA: Card RCA
  * @retval HAL status
  */
uint32_t SDMMC_CmdSetRelAdd(SDMMC_TypeDef *SDMMCx, uint16_t *pRCA)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	/* Send CMD3 SD_CMD_SET_REL_ADDR */
	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SET_REL_ADDR;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp6(SDMMCx, SDMMC_CMD_SET_REL_ADDR, pRCA);

	return errorstate;
}


/**
  * @brief  Send the Status command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Argument: Command Argument
  * @retval HAL status
  */
uint32_t SDMMC_CmdSendStatus(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = Argument;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SEND_STATUS;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SEND_STATUS, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Send the Status register command and check the response.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval HAL status
  */
uint32_t SDMMC_CmdStatusRegister(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = 0;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SD_APP_STATUS;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SD_APP_STATUS, SDMMC_CMDTIMEOUT);

	return errorstate;
}


/**
  * @brief  Sends host capacity support information and activates the card's
  *         initialization process. Send SDMMC_CMD_SEND_OP_COND command
  * @param  SDIOx: Pointer to SDIO register base
  * @parame Argument: Argument used for the command
  * @retval HAL status
  */
uint32_t SDMMC_CmdOpCondition(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = Argument;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_SEND_OP_COND;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp3(SDMMCx);

	return errorstate;
}


/**
  * @brief  Checks switchable function and switch card function. SDMMC_CMD_HS_SWITCH comand
  * @param  SDIOx: Pointer to SDIO register base
  * @parame Argument: Argument used for the command
  * @retval HAL status
  */
uint32_t SDMMC_CmdSwitch(SDMMC_TypeDef *SDMMCx, uint32_t Argument)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = Argument;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_HS_SWITCH;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_HS_SWITCH, SDMMC_CMDTIMEOUT);

	return errorstate;
}


#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
/**
  * @brief  Send the command asking the accessed card to send its operating
  *         condition register (OCR)
  * @param  None
  * @retval HAL status
  */
uint32_t SDMMC_CmdVoltageSwitch(SDMMC_TypeDef *SDMMCx)
{
	SDMMC_CmdInitTypeDef sdmmc_cmdinit;
	uint32_t errorstate;

	sdmmc_cmdinit.Argument = 0x00000000;
	sdmmc_cmdinit.CmdIndex = SDMMC_CMD_VOLTAGE_SWITCH;
	sdmmc_cmdinit.Response = SDMMC_RESPONSE_SHORT;
	sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
	sdmmc_cmdinit.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

	/* Check for error conditions */
	errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_VOLTAGE_SWITCH, SDMMC_CMDTIMEOUT);

	return errorstate;
}


#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

/**
  * @brief  Checks for error conditions for CMD0.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdError(SDMMC_TypeDef *SDMMCx)
{
	/* 8 is the number of required instructions cycles for the below loop statement.
	   The SDMMC_CMDTIMEOUT is expressed in ms */
	register uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (count-- == 0U)
		{
			return SDMMC_ERROR_TIMEOUT;
		}
	} while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CMDSENT));

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);

	return SDMMC_ERROR_NONE;
}


/**
  * @brief  Checks for error conditions for R1 response.
  * @param  hsd: SD handle
  * @param  SD_CMD: The sent command index
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp1_internal(SDMMC_TypeDef *SDMMCx, uint8_t SD_CMD, uint32_t Timeout, uint32_t *response)
{
	uint32_t response_r1;
	uint32_t flags;

	flags = SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT;

	register uint32_t count = Timeout * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CMDACT) == RESET)
		{
			break;
		}

		if (count-- == 0U) {
			return SDMMC_ERROR_TIMEOUT;
		}
	} while (!__SDMMC_GET_FLAG(SDMMCx, flags));

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

		return SDMMC_ERROR_CMD_RSP_TIMEOUT;
	}
	else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

		return SDMMC_ERROR_CMD_CRC_FAIL;
	}


	/* Check response received is of desired command */
	if (SDMMC_GetCommandResponse(SDMMCx) != SD_CMD)
	{
		return SDMMC_ERROR_CMD_CRC_FAIL;
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);

	/* We have received response, retrieve it for analysis  */
	response_r1 = SDMMC_GetResponse(SDMMCx, SDMMC_RESP1);
	if (response != NULL)
	{
		*response = response_r1;
	}

	if ((response_r1 & SDMMC_OCR_ERRORBITS) == SDMMC_ALLZERO)
	{
		return SDMMC_ERROR_NONE;
	}
	else if ((response_r1 & SDMMC_OCR_ADDR_OUT_OF_RANGE) == SDMMC_OCR_ADDR_OUT_OF_RANGE)
	{
		return SDMMC_ERROR_ADDR_OUT_OF_RANGE;
	}
	else if ((response_r1 & SDMMC_OCR_ADDR_MISALIGNED) == SDMMC_OCR_ADDR_MISALIGNED)
	{
		return SDMMC_ERROR_ADDR_MISALIGNED;
	}
	else if ((response_r1 & SDMMC_OCR_BLOCK_LEN_ERR) == SDMMC_OCR_BLOCK_LEN_ERR)
	{
		return SDMMC_ERROR_BLOCK_LEN_ERR;
	}
	else if ((response_r1 & SDMMC_OCR_ERASE_SEQ_ERR) == SDMMC_OCR_ERASE_SEQ_ERR)
	{
		return SDMMC_ERROR_ERASE_SEQ_ERR;
	}
	else if ((response_r1 & SDMMC_OCR_BAD_ERASE_PARAM) == SDMMC_OCR_BAD_ERASE_PARAM)
	{
		return SDMMC_ERROR_BAD_ERASE_PARAM;
	}
	else if ((response_r1 & SDMMC_OCR_WRITE_PROT_VIOLATION) == SDMMC_OCR_WRITE_PROT_VIOLATION)
	{
		return SDMMC_ERROR_WRITE_PROT_VIOLATION;
	}
	else if ((response_r1 & SDMMC_OCR_LOCK_UNLOCK_FAILED) == SDMMC_OCR_LOCK_UNLOCK_FAILED)
	{
		return SDMMC_ERROR_LOCK_UNLOCK_FAILED;
	}
	else if ((response_r1 & SDMMC_OCR_COM_CRC_FAILED) == SDMMC_OCR_COM_CRC_FAILED)
	{
		return SDMMC_ERROR_COM_CRC_FAILED;
	}
	else if ((response_r1 & SDMMC_OCR_ILLEGAL_CMD) == SDMMC_OCR_ILLEGAL_CMD)
	{
		return SDMMC_ERROR_ILLEGAL_CMD;
	}
	else if ((response_r1 & SDMMC_OCR_CARD_ECC_FAILED) == SDMMC_OCR_CARD_ECC_FAILED)
	{
		return SDMMC_ERROR_CARD_ECC_FAILED;
	}
	else if ((response_r1 & SDMMC_OCR_CC_ERROR) == SDMMC_OCR_CC_ERROR)
	{
		return SDMMC_ERROR_CC_ERR;
	}
	else if ((response_r1 & SDMMC_OCR_STREAM_READ_UNDERRUN) == SDMMC_OCR_STREAM_READ_UNDERRUN)
	{
		return SDMMC_ERROR_STREAM_READ_UNDERRUN;
	}
	else if ((response_r1 & SDMMC_OCR_STREAM_WRITE_OVERRUN) == SDMMC_OCR_STREAM_WRITE_OVERRUN)
	{
		return SDMMC_ERROR_STREAM_WRITE_OVERRUN;
	}
	else if ((response_r1 & SDMMC_OCR_CID_CSD_OVERWRITE) == SDMMC_OCR_CID_CSD_OVERWRITE)
	{
		return SDMMC_ERROR_CID_CSD_OVERWRITE;
	}
	else if ((response_r1 & SDMMC_OCR_WP_ERASE_SKIP) == SDMMC_OCR_WP_ERASE_SKIP)
	{
		return SDMMC_ERROR_WP_ERASE_SKIP;
	}
	else if ((response_r1 & SDMMC_OCR_CARD_ECC_DISABLED) == SDMMC_OCR_CARD_ECC_DISABLED)
	{
		return SDMMC_ERROR_CARD_ECC_DISABLED;
	}
	else if ((response_r1 & SDMMC_OCR_ERASE_RESET) == SDMMC_OCR_ERASE_RESET)
	{
		return SDMMC_ERROR_ERASE_RESET;
	}
	else if ((response_r1 & SDMMC_OCR_AKE_SEQ_ERROR) == SDMMC_OCR_AKE_SEQ_ERROR)
	{
		return SDMMC_ERROR_AKE_SEQ_ERR;
	}
	else
	{
		return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
	}
}


/**
  * @brief  Checks for error conditions for R1 response.
  * @param  hsd: SD handle
  * @param  SD_CMD: The sent command index
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp1(SDMMC_TypeDef *SDMMCx, uint8_t SD_CMD, uint32_t Timeout)
{

