dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	return SDMMC_GetCmdResp1_internal(SDMMCx, SD_CMD, Timeout, NULL);
}


/**
  * @brief  Checks for error conditions for R2 (CID or CSD) response.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp2(SDMMC_TypeDef *SDMMCx)
{
	/* 8 is the number of required instructions cycles for the below loop statement.
	   The SDMMC_CMDTIMEOUT is expressed in ms */
	register uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (count-- == 0U)
		{
			return SDMMC_ERROR_TIMEOUT;
		}

	} while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT));

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

		return SDMMC_ERROR_CMD_RSP_TIMEOUT;
	}
	else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

		return SDMMC_ERROR_CMD_CRC_FAIL;
	}
	else
	{
		/* No error flag set */
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);
	}

	return SDMMC_ERROR_NONE;
}


/**
  * @brief  Checks for error conditions for R3 (OCR) response.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp3(SDMMC_TypeDef *SDMMCx)
{
	/* 8 is the number of required instructions cycles for the below loop statement.
	   The SDMMC_CMDTIMEOUT is expressed in ms */
	register uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (count-- == 0U)
		{
			return SDMMC_ERROR_TIMEOUT;
		}
	} while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT));

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

		return SDMMC_ERROR_CMD_RSP_TIMEOUT;
	}
	else
	{
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);
	}

	return SDMMC_ERROR_NONE;
}


/**
  * @brief  Checks for error conditions for R6 (RCA) response.
  * @param  hsd: SD handle
  * @param  SD_CMD: The sent command index
  * @param  pRCA: Pointer to the variable that will contain the SD card relative
  *         address RCA
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp6(SDMMC_TypeDef *SDMMCx, uint8_t SD_CMD, uint16_t *pRCA)
{
	uint32_t response_r1;

	/* 8 is the number of required instructions cycles for the below loop statement.
	   The SDMMC_CMDTIMEOUT is expressed in ms */
	register uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (count-- == 0U)
		{
			return SDMMC_ERROR_TIMEOUT;
		}

	} while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT));

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

		return SDMMC_ERROR_CMD_RSP_TIMEOUT;
	}
	else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
	{
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

		return SDMMC_ERROR_CMD_CRC_FAIL;
	}
	else
	{
		/* Nothing to do */
	}

	/* Check response received is of desired command */
	if (SDMMC_GetCommandResponse(SDMMCx) != SD_CMD)
	{
		return SDMMC_ERROR_CMD_CRC_FAIL;
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);

	/* We have received response, retrieve it.  */
	response_r1 = SDMMC_GetResponse(SDMMCx, SDMMC_RESP1);
	if ((response_r1 & (SDMMC_R6_GENERAL_UNKNOWN_ERROR | SDMMC_R6_ILLEGAL_CMD | SDMMC_R6_COM_CRC_FAILED)) == SDMMC_ALLZERO)
	{
		*pRCA = (uint16_t)(response_r1 >> 16);

		return SDMMC_ERROR_NONE;
	}
	else if ((response_r1 & SDMMC_R6_ILLEGAL_CMD) == SDMMC_R6_ILLEGAL_CMD)
	{
		return SDMMC_ERROR_ILLEGAL_CMD;
	}
	else if ((response_r1 & SDMMC_R6_COM_CRC_FAILED) == SDMMC_R6_COM_CRC_FAILED)
	{
		return SDMMC_ERROR_COM_CRC_FAILED;
	}
	else
	{
		return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
	}
}


/**
  * @brief  Checks for error conditions for R7 response.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdResp7(SDMMC_TypeDef *SDMMCx)
{
	/* 8 is the number of required instructions cycles for the below loop statement.
	   The SDMMC_CMDTIMEOUT is expressed in ms */
	register uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

	do
	{
		if (count-- == 0U)
		{
			return SDMMC_ERROR_TIMEOUT;
		}

	} while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT));

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
	{
		/* Card is SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

		return SDMMC_ERROR_CMD_RSP_TIMEOUT;
	}
	else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
	{
		/* Card is SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

		return SDMMC_ERROR_CMD_CRC_FAIL;
	}
	else
	{
		/* Nothing to do */
	}

	if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CMDREND))
	{
		/* Card is SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CMDREND);
	}

	return SDMMC_ERROR_NONE;

}


/**
  * @brief  Configure the SDMMC data path according to the specified
  *         parameters in the SDMMC_DataInitTypeDef.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  Data : pointer to a SDMMC_DataInitTypeDef structure
  *         that contains the configuration information for the SDMMC data.
  * @retval HAL status
  */
HAL_StatusTypeDef SDMMC_ConfigData(SDMMC_TypeDef *SDMMCx, SDMMC_DataInitTypeDef *Data)
{
	/* Check the parameters */
	assert_param(IS_SDMMC_DATA_LENGTH(Data->DataLength));
	assert_param(IS_SDMMC_BLOCK_SIZE(Data->DataBlockSize));
	assert_param(IS_SDMMC_TRANSFER_DIR(Data->TransferDir));
	assert_param(IS_SDMMC_TRANSFER_MODE(Data->TransferMode));
	assert_param(IS_SDMMC_DPSM(Data->DPSM));

	/* Set the SDMMC Data TimeOut value */
	SDMMCx->DTIMER = Data->DataTimeOut;

	/* Set the SDMMC DataLength value */
	SDMMCx->DLEN = Data->DataLength;

	/* Set the SDMMC data configuration parameters */
	/* Write to SDMMC DCTRL */
	MODIFY_REG(SDMMCx->DCTRL, DCTRL_CLEAR_MASK, Data->DataBlockSize |
			   Data->TransferDir |
			   Data->TransferMode |
			   Data->SDIO |
			   Data->DPSM);

	return HAL_OK;
}


/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDMMC_GetDataCounter(SDMMC_TypeDef *SDMMCx)
{
	return (SDMMCx->DCOUNT);
}


/**
  * @brief  Get the FIFO data
  * @param  SDMMCx: Pointer to SDMMC register base
  * @retval Data received
  */
uint32_t SDMMC_GetFIFOCount(SDMMC_TypeDef *SDMMCx)
{
	return (SDMMCx->FIFO);
}


/**
  * @brief  Sets one of the two options of inserting read wait interval.
  * @param  SDMMCx: Pointer to SDMMC register base
  * @param  SDMMC_ReadWaitMode: SDMMC Read Wait operation mode.
  *          This parameter can be:
  *            @arg SDMMC_READ_WAIT_MODE_CLK: Read Wait control by stopping SDMMCCLK
  *            @arg SDMMC_READ_WAIT_MODE_DATA2: Read Wait control using SDMMC_DATA2
  * @retval None
  */
HAL_StatusTypeDef SDMMC_SetSDMMCReadWaitMode(SDMMC_TypeDef *SDMMCx, uint32_t SDMMC_ReadWaitMode)
{
	/* Check the parameters */
	assert_param(IS_SDMMC_READWAIT_MODE(SDMMC_ReadWaitMode));

	/* Set SDMMC read wait mode */
	MODIFY_REG(SDMMCx->DCTRL, SDMMC_DCTRL_RWMOD, SDMMC_ReadWaitMode);

	return HAL_OK;
}


/**
  * @}
  */


/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by a check on the card state through
  *         HAL_SD_GetCardState().
  * @note   You could also check the DMA transfer process through the SD Rx
  *         interrupt event.
  * @param  hsd: Pointer SD handle
  * @param  pData: Pointer to the buffer that will contain the received data
  * @param  BlockAdd: Block Address from where data is to be read
  * @param  NumberOfBlocks: Number of blocks to read.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_ReadBlocks_DMA(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t DataSize, uint32_t BlockSize)
{
	SDMMC_DataInitTypeDef config;

	if (NULL == pData)
	{
		hsd->ErrorCode |= HAL_SD_ERROR_PARAM;

		return HAL_ERROR;
	}

	if (hsd->State == HAL_SD_STATE_READY)
	{
		hsd->ErrorCode = HAL_SD_ERROR_NONE;

		hsd->State = HAL_SD_STATE_BUSY;
		hsd_eval.Context = SD_CONTEXT_DMA;

		/* Initialize data control register */
		hsd->Instance->DCTRL = 0U;
		hsd->pRxBuffPtr = pData;
		hsd->TxXferSize = (uint32_t)(((DataSize + (uint16_t) BlockSize - 1) / (uint16_t) BlockSize) * (uint16_t) BlockSize);

		/* Configure the SD DPSM (Data Path State Machine) */
		config.DataTimeOut = SDMMC_DATATIMEOUT;
		config.DataLength = hsd->TxXferSize;
		config.DataBlockSize = sdio_get_blocksize_dctrl(BlockSize);
		config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
		config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
		config.SDIO = SDMMC_DCTRL_SDIOEN;
		config.DPSM = SDMMC_DPSM_ENABLE;

		/* Enable transfer interrupts */
		__HAL_SD_ENABLE_IT(hsd, (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR | SDMMC_IT_DATAEND | SDMMC_IT_SDIOIT));

		hsd->Instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
		hsd->Instance->IDMABASE0 = (uint32_t) pData;

		(void)SDMMC_ConfigData(hsd->Instance, &config);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;

