dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	}
}


/**
  * @brief  Writes block(s) to a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by a check on the card state through
  *         HAL_SD_GetCardState().
  * @note   You could also check the DMA transfer process through the SD Tx
  *         interrupt event.
  * @param  hsd: Pointer to SD handle
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  BlockAdd: Block Address where data will be written
  * @param  NumberOfBlocks: Number of blocks to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_WriteBlocks_DMA(SD_HandleTypeDef *hsd, uint8_t *pData, uint32_t DataSize, uint32_t BlockSize)
{
	SDMMC_DataInitTypeDef config;

	if (NULL == pData)
	{
		hsd->ErrorCode |= HAL_SD_ERROR_PARAM;

		return HAL_ERROR;
	}

	if (hsd->State == HAL_SD_STATE_READY)
	{
		hsd->State = HAL_SD_STATE_BUSY;
		hsd_eval.Context = SD_CONTEXT_DMA;

		/* Initialize data control register */
		hsd->Instance->DCTRL = 0U;
		hsd->pTxBuffPtr = pData;
		hsd->TxXferSize = (uint32_t)(((DataSize + (uint16_t) BlockSize - 1) / (uint16_t) BlockSize) * (uint16_t) BlockSize);

		/* Configure the SD DPSM (Data Path State Machine) */
		config.DataTimeOut = SDMMC_DATATIMEOUT;
		config.DataLength = hsd->TxXferSize;
		config.DataBlockSize = sdio_get_blocksize_dctrl(BlockSize);
		config.TransferDir = SDMMC_TRANSFER_DIR_TO_CARD;
		config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
		config.SDIO = SDMMC_DCTRL_SDIOEN;
		config.DPSM = SDMMC_DPSM_ENABLE;

		/* Enable transfer interrupts */
		__HAL_SD_ENABLE_IT(hsd, (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR | SDMMC_IT_DATAEND | SDMMC_IT_SDIOIT));

		hsd->Instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
		hsd->Instance->IDMABASE0 = (uint32_t) pData;

		(void)SDMMC_ConfigData(hsd->Instance, &config);

		return HAL_OK;
	}
	else
	{
		return HAL_BUSY;
	}
}


/**
  * @brief  Writes block(s) to a specified address in an SD card, in DMA mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written
  * @param  NumOfBlocks: Number of SD blocks to write
  * @retval SD status
  */
uint8_t BSP_SD_WriteBlocks_DMA(uint32_t *pData, uint32_t DataSize, uint32_t BlockSize)
{
	HAL_StatusTypeDef sd_state = HAL_OK;

	/* Write block(s) in DMA transfer mode */
	sd_state = HAL_SD_WriteBlocks_DMA(&hsd_eval, (uint8_t *) pData, DataSize, BlockSize);

	return sd_state;
}


/**
  * @brief  Gets the current SD card data status.
  * @retval Data transfer state.
  *          This value can be one of the following values:
  *            @arg  SD_TRANSFER_OK: No data transfer is acting
  *            @arg  SD_TRANSFER_BUSY: Data transfer is acting
  */
uint8_t BSP_SD_GetCardState(void)
{
	return ((HAL_SD_GetCardState(&hsd_eval) == HAL_SD_CARD_TRANSFER) ? SD_TRANSFER_OK : SD_TRANSFER_BUSY);
}


/**
  * @brief  Get SD information about specific SD card.
  * @param  CardInfo: Pointer to HAL_SD_CardInfoTypedef structure
  * @retval None
  */

void SDMMC1_IRQHandler(void)
{
	HAL_SD_IRQHandler(&hsd_eval);
}


/**
  * @brief  This function handles SD card interrupt request.
  * @param  hsd: Pointer to SD handle
  * @retval None
  */
void HAL_SD_IRQHandler(SD_HandleTypeDef *hsd)
{

	uint32_t errorstate;
	uint32_t context = hsd->Context;

	if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_CMDSENT | SDMMC_IT_CMDREND) != RESET) {

		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_CMDREND | SDMMC_FLAG_CMDSENT);
	}

	/* Check for SDMMC interrupt flags */
	if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DATAEND) != RESET)
	{
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DATAEND);

		__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
							SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR | SDMMC_IT_TXFIFOHE | \
							SDMMC_IT_RXFIFOHF);

		__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_IDMABTC);
		__SDMMC_CMDTRANS_DISABLE(hsd->Instance);

		if ((context & SD_CONTEXT_DMA) != 0U)
		{
			hsd->Instance->DLEN = 0;
			hsd->Instance->DCTRL = 0;
			hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

			/* Stop Transfer for Write Multi blocks or Read Multi blocks */
			if (((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U) || ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
			{
				errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
				if (errorstate != HAL_SD_ERROR_NONE)
				{
					hsd->ErrorCode |= errorstate;
					HAL_SD_ErrorCallback(hsd);
				}
			}

			hsd->State = HAL_SD_STATE_READY;
			hsd->Context = SD_CONTEXT_NONE;
		}
		else
		{
			/* Nothing to do */
		}

		/* release semaphore */
		host_rtos_set_semaphore(&sdio_transfer_finished_semaphore, WICED_TRUE);

	}
	else if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_TXFIFOHE) != RESET)
	{
		SD_Write_IT(hsd);
	}
	else if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_RXFIFOHF) != RESET)
	{
		SD_Read_IT(hsd);
	}
	else if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR | SDMMC_IT_TXUNDERR) != RESET)
	{
		/* Set Error code */
		if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DCRCFAIL) != RESET)
		{
			hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
		}

		if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DTIMEOUT) != RESET)
		{
			hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
		}

		if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_RXOVERR) != RESET)
		{
			hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
		}

		if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_TXUNDERR) != RESET)
		{
			hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
		}

		/* Clear All flags */
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

		/* Disable all interrupts */
		__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
							SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

		__SDMMC_CMDTRANS_DISABLE(hsd->Instance);

		hsd->Instance->DCTRL |= SDMMC_DCTRL_FIFORST;
		hsd->Instance->CMD |= SDMMC_CMD_CMDSTOP;
		hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
		hsd->Instance->CMD &= ~(SDMMC_CMD_CMDSTOP);

