dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DABORT);

		if ((context & SD_CONTEXT_IT) != 0U)
		{
			/* Set the SD state to ready to be able to start again the process */
			hsd->State = HAL_SD_STATE_READY;
			hsd->Context = SD_CONTEXT_NONE;
			HAL_SD_ErrorCallback(hsd);
		}
		else if ((context & SD_CONTEXT_DMA) != 0U)
		{
			if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
			{
				/* Disable Internal DMA */
				__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_IDMABTC);

				hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

				/* Set the SD state to ready to be able to start again the process */
				hsd->State = HAL_SD_STATE_READY;

				HAL_SD_ErrorCallback(hsd);
			}
		}
		else
		{
			/* Nothing to do */
		}

		host_rtos_set_semaphore(&sdio_transfer_finished_semaphore, WICED_TRUE);
	}
	else
	{
		/* Nothing to do */
	}

	if (__HAL_SD_GET_FLAG(hsd, SDMMC_STA_SDIOIT) != RESET) {

		/* clear interrupt */
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STA_SDIOIT);

	}

	/* anyway, Notigy to WWD thread */
	if (hsd->State == HAL_SD_STATE_READY)

	{
		wwd_thread_notify_irq();
	}
}


/**
* @brief  Return the SD error code
* @param  hsd : Pointer to a SD_HandleTypeDef structure that contains
  *              the configuration information.
* @retval SD Error Code
*/
uint32_t HAL_SD_GetError(SD_HandleTypeDef *hsd)
{
	return hsd->ErrorCode;
}


/**
  * @}
  */

void BSP_SD_MspInit(void)
{
	irq_attach(SDMMCx_IRQn, (xcpt_t)SDMMC1_IRQHandler, NULL);

	up_prioritize_irq(SDMMCx_IRQn, 5);

	up_enable_irq(SDMMCx_IRQn);
}


/**
  * @brief  De-Initializes the SD MSP.
  * @retval None
  */
void BSP_SD_MspDeInit(SD_HandleTypeDef *hsd, void *Params)
{
	up_disable_irq(SDMMCx_IRQn);

	irq_detach(SDMMCx_IRQn);
}


/**
  * @brief BSP SD Abort callback
  * @retval None
  */
void BSP_SD_AbortCallback(void)
{

}


/**
  * @brief BSP Tx Transfer completed callback
  * @retval None
  */
void BSP_SD_WriteCpltCallback(void)
{

}


/**
  * @brief BSP Rx Transfer completed callback
  * @retval None
  */
void BSP_SD_ReadCpltCallback(void)
{

}


/**
  * @brief SD Abort callback
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_AbortCallback(SD_HandleTypeDef *hsd)
{

	BSP_SD_AbortCallback();
}


/**
  * @brief SD error callbacks
  * @param hsd: Pointer SD handle
  * @retval None
  */
void HAL_SD_ErrorCallback(SD_HandleTypeDef *hsd)
{

	/* Prevent unused argument(s) compilation warning */
	UNUSED(hsd);


	/* NOTE : This function should not be modified, when the callback is needed,
	   the HAL_SD_ErrorCallback can be implemented in the user file
	 */
}



/**
  * @brief Tx Transfer completed callback
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{

	BSP_SD_WriteCpltCallback();
}


/**
  * @brief Rx Transfer completed callback
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{

	BSP_SD_ReadCpltCallback();
}


#define BUFFER_SIZE              32
static const uint32_t aSRC_Buffer[BUFFER_SIZE] = {
	0x01020304, 0x05060708, 0x090A0B0C, 0x0D0E0F10,
	0x11121314, 0x15161718, 0x191A1B1C, 0x1D1E1F20,
	0x21222324, 0x25262728, 0x292A2B2C, 0x2D2E2F30,
	0x31323334, 0x35363738, 0x393A3B3C, 0x3D3E3F40,
	0x41424344, 0x45464748, 0x494A4B4C, 0x4D4E4F50,
	0x51525354, 0x55565758, 0x595A5B5C, 0x5D5E5F60,
	0x61626364, 0x65666768, 0x696A6B6C, 0x6D6E6F70,
	0x71727374, 0x75767778, 0x797A7B7C, 0x7D7E7F80
};


static __IO uint32_t transferErrorDetected;	/* Set to 1 if an error transfer is detected */
static __IO uint32_t transferCompleteDetected;	/* Set to 1 if transfer is correctly completed */

/* Private function prototypes -----------------------------------------------*/

/**
  * @brief  DMA conversion complete callback
  * @note   This function is executed when the transfer complete interrupt
  *         is generated
  * @retval None
  */
static void TransferComplete(void)
{

	transferCompleteDetected = 1;

}


/**
  * @brief  DMA conversion error callback
  * @note   This function is executed when the transfer error interrupt
  *         is generated during DMA transfer
  * @retval None
  */
static void TransferError(void)
{
	transferErrorDetected = 1;

}


/** @addtogroup SD_Exported_Functions_Group3
 *  @brief   management functions
 *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the SD card
    operations and get the related information

@endverbatim
  * @{
  */

/**
  * @brief  Returns information the information of the card which are stored on
  *         the CID register.
  * @param  hsd: Pointer to SD handle
  * @param  pCID: Pointer to a HAL_SD_CIDTypedef structure that
  *         contains all CID register parameters
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_GetCardCID(SD_HandleTypeDef *hsd, HAL_SD_CardCIDTypedef *pCID)
{
	pCID->ManufacturerID = (uint8_t)((hsd->CID[0] & 0xFF000000U) >> 24U);

	pCID->OEM_AppliID = (uint16_t)((hsd->CID[0] & 0x00FFFF00U) >> 8U);

	pCID->ProdName1 = (((hsd->CID[0] & 0x000000FFU) << 24U) | ((hsd->CID[1] & 0xFFFFFF00U) >> 8U));

	pCID->ProdName2 = (uint8_t)(hsd->CID[1] & 0x000000FFU);

	pCID->ProdRev = (uint8_t)((hsd->CID[2] & 0xFF000000U) >> 24U);

	pCID->ProdSN = (((hsd->CID[2] & 0x00FFFFFFU) << 8U) | ((hsd->CID[3] & 0xFF000000U) >> 24U));

	pCID->Reserved1 = (uint8_t)((hsd->CID[3] & 0x00F00000U) >> 20U);

	pCID->ManufactDate = (uint16_t)((hsd->CID[3] & 0x000FFF00U) >> 8U);

	pCID->CID_CRC = (uint8_t)((hsd->CID[3] & 0x000000FEU) >> 1U);

	pCID->Reserved2 = 1U;

	return HAL_OK;
}


/**
  * @brief  Returns information the information of the card which are stored on
  *         the CSD register.
  * @param  hsd: Pointer to SD handle
  * @param  pCSD: Pointer to a HAL_SD_CardInfoTypedef structure that
  *         contains all CSD register parameters
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_GetCardCSD(SD_HandleTypeDef *hsd, HAL_SD_CardCSDTypedef *pCSD)
{
	pCSD->CSDStruct = (uint8_t)((hsd->CSD[0] & 0xC0000000U) >> 30U);

