dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	pCSD->SysSpecVersion = (uint8_t)((hsd->CSD[0] & 0x3C000000U) >> 26U);

	pCSD->Reserved1 = (uint8_t)((hsd->CSD[0] & 0x03000000U) >> 24U);

	pCSD->TAAC = (uint8_t)((hsd->CSD[0] & 0x00FF0000U) >> 16U);

	pCSD->NSAC = (uint8_t)((hsd->CSD[0] & 0x0000FF00U) >> 8U);

	pCSD->MaxBusClkFrec = (uint8_t)(hsd->CSD[0] & 0x000000FFU);

	pCSD->CardComdClasses = (uint16_t)((hsd->CSD[1] & 0xFFF00000U) >> 20U);

	pCSD->RdBlockLen = (uint8_t)((hsd->CSD[1] & 0x000F0000U) >> 16U);

	pCSD->PartBlockRead = (uint8_t)((hsd->CSD[1] & 0x00008000U) >> 15U);

	pCSD->WrBlockMisalign = (uint8_t)((hsd->CSD[1] & 0x00004000U) >> 14U);

	pCSD->RdBlockMisalign = (uint8_t)((hsd->CSD[1] & 0x00002000U) >> 13U);

	pCSD->DSRImpl = (uint8_t)((hsd->CSD[1] & 0x00001000U) >> 12U);

	pCSD->Reserved2 = 0U;	/*!< Reserved */

	pCSD->DeviceSize = (((hsd->CSD[1] & 0x000003FFU) << 2U) | ((hsd->CSD[2] & 0xC0000000U) >> 30U));

	pCSD->MaxRdCurrentVDDMin = (uint8_t)((hsd->CSD[2] & 0x38000000U) >> 27U);

	pCSD->MaxRdCurrentVDDMax = (uint8_t)((hsd->CSD[2] & 0x07000000U) >> 24U);

	pCSD->MaxWrCurrentVDDMin = (uint8_t)((hsd->CSD[2] & 0x00E00000U) >> 21U);

	pCSD->MaxWrCurrentVDDMax = (uint8_t)((hsd->CSD[2] & 0x001C0000U) >> 18U);

	pCSD->DeviceSizeMul = (uint8_t)((hsd->CSD[2] & 0x00038000U) >> 15U);

	pCSD->EraseGrSize = (uint8_t)((hsd->CSD[2] & 0x00004000U) >> 14U);

	pCSD->EraseGrMul = (uint8_t)((hsd->CSD[2] & 0x00003F80U) >> 7U);

	pCSD->WrProtectGrSize = (uint8_t)(hsd->CSD[2] & 0x0000007FU);

	pCSD->WrProtectGrEnable = (uint8_t)((hsd->CSD[3] & 0x80000000U) >> 31U);

	pCSD->ManDeflECC = (uint8_t)((hsd->CSD[3] & 0x60000000U) >> 29U);

	pCSD->WrSpeedFact = (uint8_t)((hsd->CSD[3] & 0x1C000000U) >> 26U);

	pCSD->MaxWrBlockLen = (uint8_t)((hsd->CSD[3] & 0x03C00000U) >> 22U);

	pCSD->WriteBlockPaPartial = (uint8_t)((hsd->CSD[3] & 0x00200000U) >> 21U);

	pCSD->Reserved3 = 0;

	pCSD->ContentProtectAppli = (uint8_t)((hsd->CSD[3] & 0x00010000U) >> 16U);

	pCSD->FileFormatGroup = (uint8_t)((hsd->CSD[3] & 0x00008000U) >> 15U);

	pCSD->CopyFlag = (uint8_t)((hsd->CSD[3] & 0x00004000U) >> 14U);

	pCSD->PermWrProtect = (uint8_t)((hsd->CSD[3] & 0x00002000U) >> 13U);

	pCSD->TempWrProtect = (uint8_t)((hsd->CSD[3] & 0x00001000U) >> 12U);

	pCSD->FileFormat = (uint8_t)((hsd->CSD[3] & 0x00000C00U) >> 10U);

	pCSD->ECC = (uint8_t)((hsd->CSD[3] & 0x00000300U) >> 8U);

	pCSD->CSD_CRC = (uint8_t)((hsd->CSD[3] & 0x000000FEU) >> 1U);

	pCSD->Reserved4 = 1;

	return HAL_OK;
}


/**
  * @brief  Enables wide bus operation for the requested card if supported by
  *         card.
  * @param  hsd: Pointer to SD handle
  * @param  WideMode: Specifies the SD card wide bus mode
  *          This parameter can be one of the following values:
  *            @arg SDMMC_BUS_WIDE_8B: 8-bit data transfer
  *            @arg SDMMC_BUS_WIDE_4B: 4-bit data transfer
  *            @arg SDMMC_BUS_WIDE_1B: 1-bit data transfer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_ConfigWideBusOperation(SD_HandleTypeDef *hsd, uint32_t WideMode)
{
	SDMMC_InitTypeDef Init;
	uint32_t errorstate;

	/* Check the parameters */
	assert_param(IS_SDMMC_BUS_WIDE(WideMode));

	/* Change State */
	hsd->State = HAL_SD_STATE_BUSY;
	{
		if (WideMode == SDMMC_BUS_WIDE_8B)
		{
			hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
		}
		else if (WideMode == SDMMC_BUS_WIDE_4B)
		{
			errorstate = SD_WideBus_Enable(hsd);

			hsd->ErrorCode |= errorstate;
		}
		else if (WideMode == SDMMC_BUS_WIDE_1B)
		{
			errorstate = SD_WideBus_Disable(hsd);

			hsd->ErrorCode |= errorstate;
		}
		else
		{
			/* WideMode is not a valid argument */
			hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
		}
	}

	if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
	{
		HAL_Delay(10);

		/* Clear all the static flags */
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
		hsd->State = HAL_SD_STATE_READY;

		return HAL_ERROR;
	}
	else
	{
		Init.ClockEdge = hsd->Init.ClockEdge;
		Init.ClockPowerSave = hsd->Init.ClockPowerSave;
		Init.BusWide = WideMode;
		Init.HardwareFlowControl = hsd->Init.HardwareFlowControl;
		Init.ClockDiv = hsd->Init.ClockDiv;
		(void)SDMMC_Init(hsd->Instance, Init);
	}

	/* Change State */
	hsd->State = HAL_SD_STATE_READY;

	return HAL_OK;
}


/**
  * @brief  Gets the current sd card data state.
  * @param  hsd: pointer to SD handle
  * @retval Card state
  */
HAL_SD_CardStateTypedef HAL_SD_GetCardState(SD_HandleTypeDef *hsd)
{
	uint32_t cardstate;
	uint32_t errorstate;
	uint32_t resp1 = 0;

	errorstate = SD_SendStatus(hsd, &resp1);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		hsd->ErrorCode |= errorstate;
	}

	cardstate = ((resp1 >> 9U) & 0x0FU);

	return (HAL_SD_CardStateTypedef) cardstate;
}


/**
  * @brief  Abort the current transfer and disable the SD.
  * @param  hsd: pointer to a SD_HandleTypeDef structure that contains
  *                the configuration information for SD module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_Abort(SD_HandleTypeDef *hsd)
{
	HAL_SD_CardStateTypedef CardState;

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	uint32_t context = hsd->Context;
#endif

	/* DIsable All interrupts */
	__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
						SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

	/* Clear All flags */
	__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	/* If IDMA Context, disable Internal DMA */
	hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
#else /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	CLEAR_BIT(hsd->Instance->DCTRL, SDMMC_DCTRL_DTEN);

	if ((context & SD_CONTEXT_DMA) != 0)
	{
		/* Disable the SD DMA request */
		hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t) SDMMC_DCTRL_DMAEN);

