dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
		/* Abort the SD DMA Tx channel */
		if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0) || ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0))
		{
			if (HAL_DMA_Abort(hsd->hdmatx) != HAL_OK)
			{
				hsd->ErrorCode |= HAL_SD_ERROR_DMA;
			}
		}
		/* Abort the SD DMA Rx channel */
		else if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0) || ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0))
		{
			if (HAL_DMA_Abort(hsd->hdmarx) != HAL_OK)
			{
				hsd->ErrorCode |= HAL_SD_ERROR_DMA;
			}
		}
		else
		{
			/* Nothing to do */
		}
	}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	hsd->State = HAL_SD_STATE_READY;
	hsd->Context = SD_CONTEXT_NONE;
	CardState = HAL_SD_GetCardState(hsd);

	if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
	{
		hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
	}

	if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
	{
		return HAL_ERROR;
	}

	return HAL_OK;
}


/**
  * @brief  Abort the current transfer and disable the SD (IT mode).
  * @param  hsd: pointer to a SD_HandleTypeDef structure that contains
  *                the configuration information for SD module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_Abort_IT(SD_HandleTypeDef *hsd)
{
	HAL_SD_CardStateTypedef CardState;

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	uint32_t context = hsd->Context;

#endif

	/* Disable All interrupts */
	__HAL_SD_DISABLE_IT(hsd, SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
						SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	/* If IDMA Context, disable Internal DMA */
	hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

	/* Clear All flags */
	__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

	CardState = HAL_SD_GetCardState(hsd);
	hsd->State = HAL_SD_STATE_READY;

	if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
	{
		hsd->ErrorCode = SDMMC_CmdStopTransfer(hsd->Instance);
	}

	if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
	{
		return HAL_ERROR;
	}
	else
	{
		HAL_SD_AbortCallback(hsd);
	}

#else	/* 
 */
	CLEAR_BIT(hsd->Instance->DCTRL, SDMMC_DCTRL_DTEN);

	if ((context & SD_CONTEXT_DMA) != 0)
	{
		/* Disable the SD DMA request */
		hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t) SDMMC_DCTRL_DMAEN);

		/* Abort the SD DMA Tx channel */
		if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0) || ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0))
		{
			hsd->hdmatx->XferAbortCallback = SD_DMATxAbort;
			if (HAL_DMA_Abort_IT(hsd->hdmatx) != HAL_OK)
			{
				hsd->hdmatx = NULL;
			}
		}

		/* Abort the SD DMA Rx channel */
		else if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0) || ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0))
		{
			hsd->hdmarx->XferAbortCallback = SD_DMARxAbort;
			if (HAL_DMA_Abort_IT(hsd->hdmarx) != HAL_OK)
			{
				hsd->hdmarx = NULL;
			}
		}
		else
		{
			/* Nothing to do */
		}
	}

	/* No transfer ongoing on both DMA channels */
	else
	{
		/* Clear All flags */
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

		CardState = HAL_SD_GetCardState(hsd);
		hsd->State = HAL_SD_STATE_READY;
		hsd->Context = SD_CONTEXT_NONE;

		if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
		{
			hsd->ErrorCode = SDMMC_CmdStopTransfer(hsd->Instance);
		}

		if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
		{
			return HAL_ERROR;
		}
		else
		{
			HAL_SD_AbortCallback(hsd);
		}
	}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	return HAL_OK;
}


/**
  * @}
  */


/**
  * @brief  Initializes the sd card.
  * @param  hsd: Pointer to SD handle
  * @retval SD Card error state
  */
static uint32_t SD_InitCard(SD_HandleTypeDef *hsd)
{
	HAL_SD_CardCSDTypedef CSD;
	uint32_t errorstate;
	uint16_t sd_rca = 1;

	/* Check the power State */
	if (SDMMC_GetPowerState(hsd->Instance) == 0U)
	{
		/* Power off */
		return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
	}

	/* Send CMD3 SET_REL_ADDR with argument 0 */
	/* SD Card publishes its RCA. */
	HAL_Delay(10);

	errorstate = SDMMC_CmdSetRelAdd(hsd->Instance, &sd_rca);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		printf("SDMMC_CmdSetRelAdd ERROR!!\r\n");

		HAL_Delay(10);

		return errorstate;
	}

	/* Get the SD card RCA */
	HAL_Delay(10);

	gRelCardAdd = sd_rca;


	/* Get CSD parameters */
	if (HAL_SD_GetCardCSD(hsd, &CSD) != HAL_OK)
	{
		return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
	}

	/* Select the Card */
	HAL_Delay(10);

	errorstate = SDMMC_CmdSelDesel(hsd->Instance, (uint32_t)(((uint32_t) gRelCardAdd) << 16));
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
	/* Configure SDMMC peripheral interface */
	(void)SDMMC_Init(hsd->Instance, hsd->Init);
#endif	/* !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx && !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

	/* All cards are initialized */
	return HAL_SD_ERROR_NONE;
}


/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores SD information that will be needed in future
  *         in the SD handle.
  * @param  hsd: Pointer to SD handle
  * @retval error state
  */
static uint32_t SD_PowerON(SD_HandleTypeDef *hsd)
{
	uint32_t errorstate;

	/* CMD0: GO_IDLE_STATE */
	HAL_Delay(10);

	errorstate = SDMMC_CmdGoIdleState(hsd->Instance);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		lldbg("CMD0 ERROR\r\n");
		return errorstate;
	}

	// CMD5
	HAL_Delay(10);

