dignsys/TizenRT/os/drivers/wireless/brcm/stm32l/stm32l4xx_sdio.c
	errorstate = SDMMC_Cmd5(hsd->Instance);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		lldbg("CMD5 ERROR\r\n");
		return errorstate;
	}

	return HAL_SD_ERROR_NONE;
}


/**
  * @brief  Turns the SDMMC output signals off.
  * @param  hsd: Pointer to SD handle
  * @retval None
  */
static void SD_PowerOFF(SD_HandleTypeDef *hsd)
{
	/* Set Power State to OFF */
	(void)SDMMC_PowerState_OFF(hsd->Instance);
}


/**
  * @brief  Returns the current card's status.
  * @param  hsd: Pointer to SD handle
  * @param  pCardStatus: pointer to the buffer that will contain the SD card
  *         status (Card Status register)
  * @retval error state
  */
static uint32_t SD_SendStatus(SD_HandleTypeDef *hsd, uint32_t *pCardStatus)
{
	uint32_t errorstate;

	if (pCardStatus == NULL)
	{
		return HAL_SD_ERROR_PARAM;
	}

	/* Send Status command */
	errorstate = SDMMC_CmdSendStatus(hsd->Instance, (uint32_t)(gRelCardAdd << 16));
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	/* Get SD card status */
	*pCardStatus = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1);

	return HAL_SD_ERROR_NONE;
}


/**
  * @brief  Enables the SDMMC wide bus mode.
  * @param  hsd: pointer to SD handle
  * @retval error state
  */
static uint32_t SD_WideBus_Enable(SD_HandleTypeDef *hsd)
{
	if ((SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1) & SDMMC_CARD_LOCKED) == SDMMC_CARD_LOCKED)
	{
		return HAL_SD_ERROR_LOCK_UNLOCK_FAILED;

	}

	return HAL_SD_ERROR_NONE;
}


/**
  * @brief  Disables the SDMMC wide bus mode.
  * @param  hsd: Pointer to SD handle
  * @retval error state
  */
static uint32_t SD_WideBus_Disable(SD_HandleTypeDef *hsd)
{
	uint32_t scr[2] = {
		0, 0
	};

	uint32_t errorstate;

	if ((SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1) & SDMMC_CARD_LOCKED) == SDMMC_CARD_LOCKED)
	{
		return HAL_SD_ERROR_LOCK_UNLOCK_FAILED;
	}

	/* Get SCR Register */
	errorstate = SD_FindSCR(hsd, scr);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	/* If requested card supports 1 bit mode operation */
	if ((scr[1] & SDMMC_SINGLE_BUS_SUPPORT) != SDMMC_ALLZERO)
	{
		/* Send CMD55 APP_CMD with argument as card's RCA */
		errorstate = SDMMC_CmdAppCommand(hsd->Instance, (uint32_t)(gRelCardAdd << 16));
		if (errorstate != HAL_SD_ERROR_NONE)
		{
			return errorstate;
		}

		/* Send ACMD6 APP_CMD with argument as 0 for single bus mode */
		errorstate = SDMMC_CmdBusWidth(hsd->Instance, 0);
		if (errorstate != HAL_SD_ERROR_NONE)
		{
			return errorstate;
		}

		return HAL_SD_ERROR_NONE;
	}
	else
	{
		return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
	}
}



/**
  * @brief  Finds the SD card SCR register value.
  * @param  hsd: Pointer to SD handle
  * @param  pSCR: pointer to the buffer that will contain the SCR value
  * @retval error state
  */
static uint32_t SD_FindSCR(SD_HandleTypeDef *hsd, uint32_t *pSCR)
{
	SDMMC_DataInitTypeDef config;
	uint32_t errorstate;
	uint32_t tickstart = HAL_GetTick();
	uint32_t index = 0;
	uint32_t tempscr[2] = {
		0, 0
	};
	uint32_t *scr = pSCR;

	/* Set Block Size To 8 Bytes */
	errorstate = SDMMC_CmdBlockLength(hsd->Instance, 8);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	/* Send CMD55 APP_CMD with argument as card's RCA */
	errorstate = SDMMC_CmdAppCommand(hsd->Instance, (uint32_t)((gRelCardAdd) << 16));
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

	config.DataTimeOut = SDMMC_DATATIMEOUT;
	config.DataLength = 8;
	config.DataBlockSize = SDMMC_DATABLOCK_SIZE_8B;
	config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
	config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM = SDMMC_DPSM_ENABLE;
	(void)SDMMC_ConfigData(hsd->Instance, &config);

	/* Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
	errorstate = SDMMC_CmdSendSCR(hsd->Instance);
	if (errorstate != HAL_SD_ERROR_NONE)
	{
		return errorstate;
	}

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
	while (!__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DBCKEND | SDMMC_FLAG_DATAEND))
	{
		if ((!__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXFIFOE)) && (index == 0U))
		{
			tempscr[0] = SDMMC_ReadFIFO(hsd->Instance);
			tempscr[1] = SDMMC_ReadFIFO(hsd->Instance);
			index++;
		}

		if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
		{
			return HAL_SD_ERROR_TIMEOUT;
		}
	}
#else	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
	while (!__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DBCKEND))
	{
		if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXDAVL))
		{
			*(tempscr + index) = SDMMC_ReadFIFO(hsd->Instance);
			index++;
		}

		if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
		{
			return HAL_SD_ERROR_TIMEOUT;
		}
	}
#endif	/* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

	if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DTIMEOUT))
	{
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DTIMEOUT);

		return HAL_SD_ERROR_DATA_TIMEOUT;
	}
	else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DCRCFAIL))
	{
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DCRCFAIL);

		return HAL_SD_ERROR_DATA_CRC_FAIL;
	}
	else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR))
	{
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_RXOVERR);

		return HAL_SD_ERROR_RX_OVERRUN;
	}
	else
	{
		/* No error flag set */
		/* Clear all the static flags */
		__HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

		*scr = (((tempscr[1] & SDMMC_0TO7BITS) << 24) | ((tempscr[1] & SDMMC_8TO15BITS) << 8) | \
				((tempscr[1] & SDMMC_16TO23BITS) >> 8) | ((tempscr[1] & SDMMC_24TO31BITS) >> 24));

		scr++;

		*scr = (((tempscr[0] & SDMMC_0TO7BITS) << 24) | ((tempscr[0] & SDMMC_8TO15BITS) << 8) | \
				((tempscr[0] & SDMMC_16TO23BITS) >> 8) | ((tempscr[0] & SDMMC_24TO31BITS) >> 24));

	}

	return HAL_SD_ERROR_NONE;
}


/**
  * @brief  Wrap up reading in non-blocking mode.
  * @param  hsd: pointer to a SD_HandleTypeDef structure that contains
  *              the configuration information.
  * @retval None
  */
static void SD_Read_IT(SD_HandleTypeDef *hsd)
{
	uint32_t count, data;
	uint8_t *tmp;

	tmp = hsd->pRxBuffPtr;

	/* Read data from SDMMC Rx FIFO */
	for (count = 0U; count < 8U; count++)
	{
		data = SDMMC_ReadFIFO(hsd->Instance);
		*tmp = (uint8_t)(data & 0xFFU);
		tmp++;
		*tmp = (uint8_t)((data >> 8U) & 0xFFU);
		tmp++;
		*tmp = (uint8_t)((data >> 16U) & 0xFFU);
		tmp++;
		*tmp = (uint8_t)((data >> 24U) & 0xFFU);
		tmp++;
	}

	hsd->pRxBuffPtr = tmp;
}


/**
  * @brief  Wrap up writing in non-blocking mode.
  * @param  hsd: pointer to a SD_HandleTypeDef structure that contains
  *              the configuration information.
  * @retval None
  */
static void SD_Write_IT(SD_HandleTypeDef *hsd)
{
	uint32_t count, data;
	uint8_t *tmp;

	tmp = hsd->pTxBuffPtr;

	/* Write data to SDMMC Tx FIFO */
	for (count = 0U; count < 8U; count++)
	{
		data = (uint32_t)(*tmp);
		tmp++;
		data |= ((uint32_t)(*tmp) << 8U);
		tmp++;
		data |= ((uint32_t)(*tmp) << 16U);
		tmp++;
		data |= ((uint32_t)(*tmp) << 24U);
		tmp++;
		(void)SDMMC_WriteFIFO(hsd->Instance, &data);
	}

	hsd->pTxBuffPtr = tmp;
}


/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
